app/controllers/mesas_controller.rb

    def index
        @mesas = Mesa.all
---
SELECT "mesas".* FROM "mesas"

    def edit
    @mesa = Mesa.find(params[:id])
---
SELECT  "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        #@mesa = Mesa.new(params[:mesa])

        @mesa = Mesa.new(params.require(:mesa).permit(:modelo, :marca, :caract, :dim, :patas))
        if @mesa.save
---
INSERT INTO "mesas" ("modelo", "marca", "caract", "dim", "patas", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["modelo", "Modelo 1"], ["marca", "Marca 1"], ["caract", "iwiwiwi"], ["dim", "20x87"], ["patas", 9], ["created_at", "2019-10-08 20:01:06.316267"], ["updated_at", "2019-10-08 20:01:06.316267"]]

    def show
        @mesa = Mesa.find(params[:id])
---
SELECT  "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @mesa = Mesa.find(params[:id])

        if @mesa.update(mesa_params)
---
SELECT  "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "mesas" SET "modelo" = ?, "marca" = ?, "updated_at" = ? WHERE "mesas"."id" = ?  [["modelo", "Modelo 2"], ["marca", "Marca 2"], ["updated_at", "2019-10-08 20:01:21.088837"], ["id", 3]]

      def destroy
        @mesa = Mesa.find(params[:id])
        @mesa.destroy
---
SELECT  "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "mesas" WHERE "mesas"."id" = ?  [["id", 1]]